<?php

/*$var = 123;
$var = 3.14;
$var = 'string'; всегда будет использоваться последнее присвоения типа данных к переменной*/

/*$var = 123;
echo "Значение переменной: $var" . '<br>';//при двойных ковычках переменных интерпритатор будет искать переменные
echo 'Значение переменной: $var';// при одинарных ковычках будет выводится то,что написали*/

/*$x = 1;
echo $x + '2'; php умный,при любом операторе будет преобразовывать строку в число(называется "Приведение типов"
(тип_к_которому_нужно_привести) значение (так можно самому сказать,что каким типом должно быть)*/

/*$string = '123';
$numeric = (int) $string;
echo $string;
(тип_к_которому_нужно_привести) значение (так можно самому сказать,что каким типом должно быть)*/
echo 'hello';

