<?php

/*$sum = 5 + 10;
echo $sum;*/

/*$x = 2 + 3;
$y = ($x * 2) / ($x + 1);

echo $y;*/
// ДОМАШНЕЕ ЗАДАНИЕ
//1 Присвойте переменным $a и $b значения 3 и 5 соответственно.
// С помощью третьей переменной $c поменяйте значения этих переменных (в $a будет 5, а в $b будет 3)
/*$a = 3;
$b = 5;
$c = $a;
$a = $b;
$b = $c;*/
/*//2 Проделайте тоже самое, но без использования третьей переменной,
// при условии что в качестве значений могут быть только целые числа
$a = 3;
$b = 5;
$a = $a + $b;
$b = $a - $b;
$a = $a - $b;
echo $b;*/
